In [95]:
import numpy as np
import pandas as pd

In [ ]:
### l'objectfi du projet est de l'impact environnemental du commerce en suivant un indicateur qui est l'empreinte carbone

In [69]:
df=pd.read_csv('annual_co2_emissions.csv')

In [91]:
df

            Entity Code  Year  Annual CO₂ emissions
0      Afghanistan  AFG  1949               14656.0
1      Afghanistan  AFG  1950               84272.0
2      Afghanistan  AFG  1951               91600.0
3      Afghanistan  AFG  1952               91600.0
4      Afghanistan  AFG  1953              106256.0
...            ...  ...   ...                   ...
31344     Zimbabwe  ZWE  2017             9596071.0
31345     Zimbabwe  ZWE  2018            11795478.0
31346     Zimbabwe  ZWE  2019            11114607.0
31347     Zimbabwe  ZWE  2020            10607897.0
31348     Zimbabwe  ZWE  2021            11296114.0

[31349 rows x 4 columns]

In [92]:
df1=pd.read_csv('BACI_HS17_Y2021_V202501.csv')

In [93]:
df1

             t    i    j       k        v       q
0         2021    4   20  420229    0.598   0.001
1         2021    4   20  621050    0.200   0.001
2         2021    4   20  640319    0.167   0.001
3         2021    4   20  870899    0.461   0.001
4         2021    4   24  382499   55.706  13.235
...        ...  ...  ...     ...      ...     ...
11574289  2021  894  858  240120  212.905  39.600
11574290  2021  894  858  842123    1.002   0.040
11574291  2021  894  858  842139    1.103   0.044
11574292  2021  894  858  870810    0.087   0.003
11574293  2021  894  858  870829    0.949   0.036

[11574294 rows x 6 columns]

In [99]:
## l'objectif est de faire la somme des importations 
baci1=df1.groupby(["t", "j"], as_index=False)["v"].sum().rename(columns={"t": "year", "v": "value_total"})
baci1

     year    j   value_total
0    2021    4  7.251111e+06
1    2021    8  6.503024e+06
2    2021   12  3.414934e+07
3    2021   16  1.523882e+05
4    2021   20  1.566174e+06
..    ...  ...           ...
221  2021  862  7.164917e+06
222  2021  876  4.897651e+04
223  2021  882  5.012101e+05
224  2021  887  1.228167e+07
225  2021  894  7.467492e+06

[226 rows x 3 columns]

In [ ]:
baci1.describe()

         year           j   value_total
count   226.0  226.000000  2.260000e+02
mean   2021.0  432.526549  9.502525e+07
std       0.0  252.246690  2.798317e+08
min    2021.0    4.000000  3.264373e+03
25%    2021.0  212.500000  1.421490e+06
50%    2021.0  437.000000  9.322385e+06
75%    2021.0  650.500000  4.979826e+07
max    2021.0  894.000000  2.782001e+09

In [72]:
df2=pd.read_csv('BACI_HS22_Y2023_V202501.csv')

In [73]:
print(df1.columns)
print(df2.columns)

Index(['t', 'i', 'j', 'k', 'v', 'q'], dtype='object')
Index(['t', 'i', 'j', 'k', 'v', 'q'], dtype='object')

In [83]:
df2.head()

      t  i   j       k       v       q
0  2023  4  20  200290   8.013   5.830
1  2023  4  31  252620   9.808  77.150
2  2023  4  31  680221  33.788  76.655
3  2023  4  31  761510   6.604   2.368
4  2023  4  31  860900   1.500   2.200

In [88]:
df1.groupby('i').sum()

            t        j           k             v             q
i
4    10850052  2560981  3002084280  1.629938e+06  5.443939e+06
8    32637102  7289074  9746327844  4.445785e+06  3.174843e+06
12   12285672  2796572  3265078603  6.210481e+07  7.345425e+07
16    2361696   495916   791917505  1.678709e+04  9.399246e+03
20   13907316  3270545  4634363273  3.962281e+05  6.218478e+04
..        ...      ...         ...           ...           ...
862   8320530  1799060  2393915745  4.577083e+06  9.543463e+06
876    289146    62062    99384028  1.196336e+03  1.209260e+02
882   1455840   290990   440953703  5.245472e+04  1.336964e+04
887   3609270   889599   718260161  1.987231e+06  2.206255e+06
894  18691368  4247450  5618208415  1.442671e+07  6.740799e+06

[226 rows x 5 columns]

In [90]:
df2.groupby('i').sum()

            t        j            k             v             q
i
4    12024712  2794063   3316321215  1.662870e+06  3.454556e+06
8    34544748  7860564  10291335996  4.398079e+06  3.525237e+06
12   12477864  2877932   3265482674  5.176305e+07  8.242002e+07
16    1780240   354585    603736506  1.823412e+04  8.365401e+03
20   13333593  3182733   4407833085  2.533501e+05  3.120319e+05
..        ...      ...          ...           ...           ...
862   8237656  1813095   2328526452  7.455044e+06  1.785330e+07
876    315588    58765     98370093  1.926535e+03  5.930900e+01
882   1308881   254532    415222322  4.605493e+04  4.820133e+03
887   3374364   900091    631419923  1.046597e+06  6.853195e+05
894  20505128  4825299   6141517449  1.547926e+07  6.960046e+06

[226 rows x 5 columns]

In [ ]:
baci=pd.concat()